app/views/parts/_form.html.erb

SELECT "categories".* FROM "categories"
---
        <label>Category</label>
        <%= f.collection_select :category_id, Category.all, :id, :description, {prompt: "Select a category"}, {class: "form-control"} %>