app/controllers/backoffice/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT "admins".* FROM "admins"

    def set_admin
      @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 ORDER BY "admins"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]