app/controllers/backoffice/members_controller.rb

  def create
    @member = Member.new(params_member)
    if @member.save
---
INSERT INTO "members" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    psw = params[:member][:password]
    psw_confirmation = params[:member][:password_confirmation]

    if psw.blank? && psw_confirmation.blank?
      params[:member].delete(:password)
      params[:member].delete(:password_confirmation)

    end
    if @member.update(params_member)
---
UPDATE "members" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "members"."id" = $3  [["encrypted_password", "$2a$11$VtFJwPakNaejE.E13e7Spu4bjFGo0WqGmISRwHlr5j65rmqcSmkVK"], ["updated_at", "2017-09-05 04:15:54.883709"], ["id", 1]]

    def set_member
      @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]