app/views/company_parts/_form.html.erb

        <label> Empresa</label>
        <%= f.collection_select :company_id, Company.all, :id, :name, {prompt:
---
SELECT "companies".* FROM "companies"

        <label>Carro</label>
       <%= f.collection_select :id, Car.all, :id, :model,
        {prompt: "Selecione a car..."}, {class: "form-control", id:"idSelectCar"} %>
---
SELECT  "cars".* FROM "cars" ORDER BY "cars"."id" ASC LIMIT $1  [["LIMIT", 1]]


        <%= f.collection_select :id, Category.all, :id, :description,
        {prompt: "Selecione a car..."}, {class: "form-control", id:"idSelectCategory"} %>
---
SELECT  "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT $1  [["LIMIT", 1]]

        <label> Peça</label>
        <%= f.collection_select :part_id, Part.all, :id, :description,
        {prompt: "Selecione a peça..."}, {class: "form-control", required: true, id:"idSelectParts"} %>
---
SELECT "parts".* FROM "parts"