app/controllers/cars_controller.rb

  def destroy
    @car.destroy
---
DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 3]]