app/controllers/company_parts_controller.rb

SELECT "company_parts".* FROM "company_parts"
---
  def index
    @company_parts = CompanyPart.all

INSERT INTO "company_parts" ("company_id", "part_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["company_id", 3], ["part_id", 15], ["created_at", "2017-09-06 19:38:37.901340"], ["updated_at", "2017-09-06 19:38:37.901340"]]
---
  def create
    @company_part = CompanyPart.new(company_part_params)

    respond_to do |format|
      if @company_part.save

DELETE FROM "company_parts" WHERE "company_parts"."id" = $1  [["id", 1]]
---
  def destroy
    @company_part.destroy

SELECT  "company_parts".* FROM "company_parts" WHERE "company_parts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_company_part
    @company_part = CompanyPart.find(params[:id])