app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "cnpj", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Evolução"], ["cnpj", "451246"], ["created_at", "2017-09-01 20:14:03.357359"], ["updated_at", "2017-09-01 20:14:03.357359"]]
---
  def create
    # salva os mebros a empresa junto com a company
    @company = CompaniesController::CompanyService.create_company_and_join_companyMember(company_params, company_member: :member_id)

UPDATE "companies" SET "cnpj" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["cnpj", "4512468"], ["updated_at", "2017-09-01 20:14:41.493457"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @company.update(company_params)

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 11]]
---
  def destroy
    @company.destroy

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def set_company
    @company = Company.find(params[:id])