app/controllers/parts_controller.rb

SELECT "parts".* FROM "parts"
---
  def index
    @parts = Part.all

DELETE FROM "parts" WHERE "parts"."id" = $1  [["id", 27]]
---
  def destroy
    @part.destroy

SELECT  "parts".* FROM "parts" WHERE "parts"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
    def set_part
      @part = Part.find(params[:id])